In [1]:
import pandas as pd
df = pd.read_csv(r'C:\Users\bhoom\Downloads\stack-overflow-developer-survey-2024\survey_results_schema.csv')

df

,qid,qname,question,force_resp,type,selector
0,QID2,MainBranch,Which of the following options best describes ...,True,MC,SAVR
1,QID127,Age,What is your age?*,True,MC,SAVR
2,QID296,Employment,Which of the following best describes your cur...,True,MC,MAVR
3,QID308,RemoteWork,Which best describes your current work situation?,False,MC,SAVR
4,QID341,Check,Just checking to make sure you are paying atte...,True,MC,SAVR
...,...,...,...,...,...,...
82,QID337,JobSatPoints_7,"Learning and using new technology, including p...",NaN,MC,MAVR
83,QID337,JobSatPoints_8,"Designing and building environments, databases...",NaN,MC,MAVR
84,QID337,JobSatPoints_9,"Being a power user of a tool, developer langua...",NaN,MC,MAVR
85,QID337,JobSatPoints_10,Working with new and/or top-quality hardware,NaN,MC,MAVR
86,QID337,JobSatPoints_11,A well-staffed/sourced internal network that m...,NaN,MC,MAVR

In [2]:
df.shape

(87, 6)

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 87 entries, 0 to 86
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   qid         87 non-null     object
 1   qname       87 non-null     object
 2   question    87 non-null     object
 3   force_resp  66 non-null     object
 4   type        87 non-null     object
 5   selector    87 non-null     object
dtypes: object(6)
memory usage: 4.2+ KB

In [4]:
pd.set_option('display.max_columns',85)
pd.set_option('display.max_rows',85)

In [5]:
import pandas as pd
schema_df = pd.read_csv(r'C:\Users\bhoom\Downloads\stack-overflow-developer-survey-2024\survey_results_schema.csv')
schema_df.sort_index()

,qid,qname,question,force_resp,type,selector
0,QID2,MainBranch,Which of the following options best describes ...,True,MC,SAVR
1,QID127,Age,What is your age?*,True,MC,SAVR
2,QID296,Employment,Which of the following best describes your cur...,True,MC,MAVR
3,QID308,RemoteWork,Which best describes your current work situation?,False,MC,SAVR
4,QID341,Check,Just checking to make sure you are paying atte...,True,MC,SAVR
...,...,...,...,...,...,...
82,QID337,JobSatPoints_7,"Learning and using new technology, including p...",NaN,MC,MAVR
83,QID337,JobSatPoints_8,"Designing and building environments, databases...",NaN,MC,MAVR
84,QID337,JobSatPoints_9,"Being a power user of a tool, developer langua...",NaN,MC,MAVR
85,QID337,JobSatPoints_10,Working with new and/or top-quality hardware,NaN,MC,MAVR
86,QID337,JobSatPoints_11,A well-staffed/sourced internal network that m...,NaN,MC,MAVR

In [6]:
schema_df.head(10)

,qid,qname,question,force_resp,type,selector
0,QID2,MainBranch,Which of the following options best describes ...,True,MC,SAVR
1,QID127,Age,What is your age?*,True,MC,SAVR
2,QID296,Employment,Which of the following best describes your cur...,True,MC,MAVR
3,QID308,RemoteWork,Which best describes your current work situation?,False,MC,SAVR
4,QID341,Check,Just checking to make sure you are paying atte...,True,MC,SAVR
5,QID297,CodingActivities,Which of the following best describes the code...,False,MC,MAVR
6,QID25,EdLevel,Which of the following best describes the high...,True,MC,SAVR
7,QID276,LearnCode,How do you learn to code? Select all that apply.,False,MC,MAVR
8,QID281,LearnCodeOnline,What online resources do you use to learn to c...,False,MC,MAVR
9,QID331,TechDoc,What is the source of the technical documentat...,False,MC,MAVR

In [7]:
schema_df['question'].head(15)

0     Which of the following options best describes ...
1                                    What is your age?*
2     Which of the following best describes your cur...
3     Which best describes your current work situation?
4     Just checking to make sure you are paying atte...
5     Which of the following best describes the code...
6     Which of the following best describes the high...
7      How do you learn to code? Select all that apply.
8     What online resources do you use to learn to c...
9     What is the source of the technical documentat...
10    Including any education, how many years have y...
11    NOT including education, how many years have y...
12    Which of the following describes your current ...
13    Approximately how many people are employed by ...
14    What level of influence do you, personally, ha...
Name: question, dtype: object

In [8]:
schema_df.describe()

,qid,qname,question,force_resp,type,selector
count,87,87,87,66,87,87
unique,66,87,87,2,5,8
top,QID337,MainBranch,Which of the following options best describes ...,False,MC,MAVR
freq,10,1,1,56,68,37

In [9]:
schema_df.tail(10)

,qid,qname,question,force_resp,type,selector
77,QID290,Frequency_3,Encountering knowledge silos (where one indivi...,NaN,MC,MAVR
78,QID337,JobSatPoints_1,Driving strategy for my team,NaN,MC,MAVR
79,QID337,JobSatPoints_4,Contributing to open source,NaN,MC,MAVR
80,QID337,JobSatPoints_5,Securing data and environments,NaN,MC,MAVR
81,QID337,JobSatPoints_6,Improving quality of code and developer enviro...,NaN,MC,MAVR
82,QID337,JobSatPoints_7,"Learning and using new technology, including p...",NaN,MC,MAVR
83,QID337,JobSatPoints_8,"Designing and building environments, databases...",NaN,MC,MAVR
84,QID337,JobSatPoints_9,"Being a power user of a tool, developer langua...",NaN,MC,MAVR
85,QID337,JobSatPoints_10,Working with new and/or top-quality hardware,NaN,MC,MAVR
86,QID337,JobSatPoints_11,A well-staffed/sourced internal network that m...,NaN,MC,MAVR

In [10]:
schema_df.describe()
schema_df.columns

Index(['qid', 'qname', 'question', 'force_resp', 'type', 'selector'], dtype='object')

In [11]:
schema_df.index

RangeIndex(start=0, stop=87, step=1)

In [12]:
schema_pd.DataFrame()

NameError: name 'schema_pd' is not defined

In [ ]:
pd.Series()

In [13]:
pd.isna()

TypeError: isna() missing 1 required positional argument: 'obj'

In [14]:
person = {
    "first" : "bhoomu",
    "last" : "cutu",
    "email" : "bhoomicat@gmail.com"
}

In [15]:
person['email']

'bhoomicat@gmail.com'

In [16]:
import pandas as pd

person = [
    {"first": "bhoomu",
     "last": "cutu", 
     "email": "bhoomicat@gmail.com"},
    {"first":"dora",
     "last":"berju",
     "email":"abbejaaa@gmail.com"
    }
]

df = pd.DataFrame(person)
print(df)

    first   last                email
0  bhoomu   cutu  bhoomicat@gmail.com
1    dora  berju   abbejaaa@gmail.com

In [17]:
df['email']

0    bhoomicat@gmail.com
1     abbejaaa@gmail.com
Name: email, dtype: object

In [18]:
type(df['email'])

pandas.core.series.Series

In [19]:
df.email

0    bhoomicat@gmail.com
1     abbejaaa@gmail.com
Name: email, dtype: object

In [20]:
 df[['last','email']]
df['last'] == "cutu"

0     True
1    False
Name: last, dtype: bool

In [21]:
df.iloc[1]

first                  dora
last                  berju
email    abbejaaa@gmail.com
Name: 1, dtype: object

In [22]:
df.shape

(2, 3)

In [23]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [24]:
 df.columns = ['first_name', 'last_name', "email_ID"]
df

  first_name last_name             email_ID
0     bhoomu      cutu  bhoomicat@gmail.com
1       dora     berju   abbejaaa@gmail.com

In [25]:
df.rename(columns={'first_name':'first','last_name':'last'})

    first   last             email_ID
0  bhoomu   cutu  bhoomicat@gmail.com
1    dora  berju   abbejaaa@gmail.com

In [26]:
df.loc[2] = ['John' , 'Smith' , 'JohnSmith.com']
df

  first_name last_name             email_ID
0     bhoomu      cutu  bhoomicat@gmail.com
1       dora     berju   abbejaaa@gmail.com
2       John     Smith        JohnSmith.com

In [27]:
df.loc[2,['last_name','email_ID']]

last_name            Smith
email_ID     JohnSmith.com
Name: 2, dtype: object

In [28]:
filt = (df['email_ID'] == 'JohnSmith.com')
df[filt]

  first_name last_name       email_ID
2       John     Smith  JohnSmith.com

In [29]:
def update_email(email_ID):
    return email_ID.upper()

In [30]:
df['email_ID'].apply(update_email)

0    BHOOMICAT@GMAIL.COM
1     ABBEJAAA@GMAIL.COM
2          JOHNSMITH.COM
Name: email_ID, dtype: object

In [31]:
df['email_ID'] = df['email_ID'].apply(lambda x : x.lower())

In [32]:
df

  first_name last_name             email_ID
0     bhoomu      cutu  bhoomicat@gmail.com
1       dora     berju   abbejaaa@gmail.com
2       John     Smith        johnsmith.com

In [33]:
df['email_ID'].apply(len)

0    19
1    18
2    13
Name: email_ID, dtype: int64

In [34]:
df.apply(pd.Series.min)

first_name                  John
last_name                  Smith
email_ID      abbejaaa@gmail.com
dtype: object

In [35]:
df.apply(lambda x: x.min())

first_name                  John
last_name                  Smith
email_ID      abbejaaa@gmail.com
dtype: object

In [36]:
df.applymap(len)

C:\Users\bhoom\AppData\Local\Temp\ipykernel_34668\1485728669.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(len)

   first_name  last_name  email_ID
0           6          4        19
1           4          5        18
2           4          5        13

In [37]:
df.map(str.upper)

  first_name last_name             email_ID
0     BHOOMU      CUTU  BHOOMICAT@GMAIL.COM
1       DORA     BERJU   ABBEJAAA@GMAIL.COM
2       JOHN     SMITH        JOHNSMITH.COM

In [38]:
df['first_name'].map({'bhoomu':'bhooms','dora':'dharti'})

0    bhooms
1    dharti
2       NaN
Name: first_name, dtype: object

In [39]:
df['first_name'].replace({'bhoomu':'bhooms','dora':'dharti'})

0    bhooms
1    dharti
2      John
Name: first_name, dtype: object

In [40]:
import pandas as pd
df = pd.DataFrame(person)
df

    first   last                email
0  bhoomu   cutu  bhoomicat@gmail.com
1    dora  berju   abbejaaa@gmail.com

In [41]:
df['first'] + ' ' + df['last']

0    bhoomu cutu
1     dora berju
dtype: object

In [42]:
df['full_name'] = df['first']+ ' ' +df['last']
df

    first   last                email    full_name
0  bhoomu   cutu  bhoomicat@gmail.com  bhoomu cutu
1    dora  berju   abbejaaa@gmail.com   dora berju

In [43]:
df.drop(columns= ['first','last'])

                 email    full_name
0  bhoomicat@gmail.com  bhoomu cutu
1   abbejaaa@gmail.com   dora berju

In [44]:
 df

    first   last                email    full_name
0  bhoomu   cutu  bhoomicat@gmail.com  bhoomu cutu
1    dora  berju   abbejaaa@gmail.com   dora berju

In [45]:
df.sort_values(by='last', ascending = True)

    first   last                email    full_name
1    dora  berju   abbejaaa@gmail.com   dora berju
0  bhoomu   cutu  bhoomicat@gmail.com  bhoomu cutu

In [46]:
df.sort_index()

    first   last                email    full_name
0  bhoomu   cutu  bhoomicat@gmail.com  bhoomu cutu
1    dora  berju   abbejaaa@gmail.com   dora berju

In [47]:
data = {
    'Department' : ['IT','HR','IT','HR','FINANCE','IT'],
    'Employee': ['Alice','Bobby','Chutiya','David','Eve','Frank'],
    'Salary':[70000,89000,23000,45000,7000,12500]
}

df = pd.DataFrame(data)
df.groupby('Department')['Salary'].sum()

Department
FINANCE      7000
HR         134000
IT         105500
Name: Salary, dtype: int64

In [48]:
df.groupby('Department')['Salary'].agg(['sum','mean','count'])

               sum          mean  count
Department
FINANCE       7000   7000.000000      1
HR          134000  67000.000000      2
IT          105500  35166.666667      3

In [49]:
df.pivot_table(index='Department', values='Salary', aggfunc='sum')

            Salary
Department
FINANCE       7000
HR          134000
IT          105500

In [50]:
df.groupby('Department')['Salary'].cumsum()

0     70000
1     89000
2     93000
3    134000
4      7000
5    105500
Name: Salary, dtype: int64

In [51]:
df.groupby('Department')['Salary'].describe()

,count,mean,std,min,25%,50%,75%,max
Department,,,,,,,,
FINANCE,1.0,7000.000000,NaN,7000.0,7000.0,7000.0,7000.0,7000.0
HR,2.0,67000.000000,31112.698372,45000.0,56000.0,67000.0,78000.0,89000.0
IT,3.0,35166.666667,30619.982582,12500.0,17750.0,23000.0,46500.0,70000.0

In [52]:
df.groupby('Department')['Salary'].mean()  # Average Salary
df.groupby('Department')['Salary'].min()   # Minimum Salary
df.groupby('Department')['Salary'].max()   # Maximum Salary
df.groupby('Department')['Salary'].sum()   # Total Salary

Department
FINANCE      7000
HR         134000
IT         105500
Name: Salary, dtype: int64

In [53]:
df.groupby('Department').nth(0)

  Department Employee  Salary
0         IT    Alice   70000
1         HR    Bobby   89000
4    FINANCE      Eve    7000

In [54]:
df.groupby('Department').filter(lambda x : x['Salary'].mean()>60000)

  Department Employee  Salary
1         HR    Bobby   89000
3         HR    David   45000

In [55]:
import pandas as pd
import numpy as np

In [56]:
people  = {
    'first': ['corey','chris','John','Jane',np.nan, None, 'NA'],
    'last' : ['schina','eenaa','maneana','tamena',np.nan,np.nan,'Missing'],
    'age': ['19','18','17','16','15','14','13']
}

In [57]:
df=pd.DataFrame(people)

In [58]:
df

   first     last age
0  corey   schina  19
1  chris    eenaa  18
2   John  maneana  17
3   Jane   tamena  16
4    NaN      NaN  15
5   None      NaN  14
6     NA  Missing  13

In [59]:
df.dropna()

   first     last age
0  corey   schina  19
1  chris    eenaa  18
2   John  maneana  17
3   Jane   tamena  16
6     NA  Missing  13

In [60]:
df.isna()

   first   last    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4   True   True  False
5   True   True  False
6  False  False  False

In [61]:
df.fillna('MISSING-U-BABY')

            first            last age
0           corey          schina  19
1           chris           eenaa  18
2            John         maneana  17
3            Jane          tamena  16
4  MISSING-U-BABY  MISSING-U-BABY  15
5  MISSING-U-BABY  MISSING-U-BABY  14
6              NA         Missing  13

In [62]:
df.fillna(0)

   first     last age
0  corey   schina  19
1  chris    eenaa  18
2   John  maneana  17
3   Jane   tamena  16
4      0        0  15
5      0        0  14
6     NA  Missing  13

In [63]:
df.dtypes

first    object
last     object
age      object
dtype: object

In [64]:
type[np.nan]

type[nan]

In [65]:
df['age'] = df['age'].astype(float)

In [66]:
df.dtypes

first     object
last      object
age      float64
dtype: object

In [67]:
df['age'].mean()

np.float64(16.0)

In [68]:
import pandas as pd

data = {
   'Name':['Alice','Bob','Charlie','David'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston'],
    'Salary': [60000, 70000, 80000, 90000],
    'Join_Date': ['2024-01-01', '2024-09-15', '2024-03-10', '2024-04-05'] 
}
df=pd.DataFrame(data)

df.to_csv('data.csv',index=False)
df.to_excel('file_path', index=False,engine = 'openpyxl')
df

      Name  Age         City  Salary   Join_Date
0    Alice   25     New York   60000  2024-01-01
1      Bob   30  Los Angeles   70000  2024-09-15
2  Charlie   35      Chicago   80000  2024-03-10
3    David   40      Houston   90000  2024-04-05

In [69]:
df.to_json('data.json')

In [11]:
from sqlalchemy import create_engine
import psycopg2
import pandas as pd
conn = psycopg2.connect(
    dbname="mydatabase",
    user="postgres",
    password="bhoomi90#",
    host="localhost",
    port="5432"
)
data = pd.DataFrame({
    'id':[1,3,4],
    'name':['Alice','Bhoomi','Charlie'],
    'age':[25,30,35]
})

In [12]:
engine = create_engine("postgresql+psycopg2://user:password@localhost:5432/mydatabase")

print("Connected to PostgreSQL!")

Connected to PostgreSQL!

In [13]:
data.to_sql('sample_table',engine)
print("Data inserted sucessfully ")

OperationalError: (psycopg2.OperationalError) connection to server at "localhost" (::1), port 5432 failed: FATAL:  password authentication failed for user "user"

(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [71]:
df.dtypes

Name         object
Age           int64
City         object
Salary        int64
Join_Date    object
dtype: object

In [72]:
df['Join_Date']=pd.to_datetime(df['Join_Date'])

In [73]:
df.dtypes

Name                 object
Age                   int64
City                 object
Salary                int64
Join_Date    datetime64[ns]
dtype: object

In [74]:
df['Join_Date'].dt.day_name()

0    Monday
1    Sunday
2    Sunday
3    Friday
Name: Join_Date, dtype: object

In [75]:
df['DayOfWeek'] = df['Join_Date'].dt.day_name()

In [76]:
df

      Name  Age         City  Salary  Join_Date DayOfWeek
0    Alice   25     New York   60000 2024-01-01    Monday
1      Bob   30  Los Angeles   70000 2024-09-15    Sunday
2  Charlie   35      Chicago   80000 2024-03-10    Sunday
3    David   40      Houston   90000 2024-04-05    Friday

In [77]:
df['Join_Date'].min()

Timestamp('2024-01-01 00:00:00')

In [78]:
df['Join_Date'].max()

Timestamp('2024-09-15 00:00:00')

In [79]:
df['Join_Date'].max()-df['Join_Date'].min()

Timedelta('258 days 00:00:00')

In [80]:
filt =  (df['Join_Date']>='2024')
df.loc[filt]

      Name  Age         City  Salary  Join_Date DayOfWeek
0    Alice   25     New York   60000 2024-01-01    Monday
1      Bob   30  Los Angeles   70000 2024-09-15    Sunday
2  Charlie   35      Chicago   80000 2024-03-10    Sunday
3    David   40      Houston   90000 2024-04-05    Friday